system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-8000     0   -4000)   // 0
    ( 4000     0   -4000)   // 1
    ( 4000  4000   -4000)   // 2
    (-8000  4000   -4000)   // 3

    (-8000     0    4000)   // 4
    ( 4000     0    4000)   // 5
    ( 4000  4000    4000)   // 6
    (-8000  4000    4000)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 5 6 2)   // x = 4000
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (0 3 7 4)   // x = -8000
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 4 5 1)   // y = 0
        );
    }

    walls
    {
        type symmetry;
        faces
        (
            (0 1 2 3)   // z = -4000
			(4 7 6 5)   // z = 4000
			(3 2 6 7)   // y = 4000
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
