Allmesh
blockMesh | tee log.blockMesh
snappyHexMesh -overwrite | tee log.snappyHexMesh
